In [2]:
import json
import pandas as pd
import numpy as np

In [3]:
#import the european restaurant data
file_name = "../trip_advisor/tripadvisor_european_restaurants.csv"
import_csv = pd.read_csv(file_name)

C:\Users\julia\anaconda3\envs\PythonData\lib\site-packages\IPython\core\interactiveshell.py:3166: DtypeWarning: Columns (4) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [38]:
#import Data into DF
euro_resto = pd.DataFrame(import_csv)

In [39]:
#drop columns not used
euro_resto_clean = euro_resto.drop(['restaurant_link','original_location', 'claimed', 'keywords', 
                              'atmosphere', 'price_range', 'popularity_detailed', 
                              'popularity_generic', 'top_tags', 'meals','special_diets', 'features', 
                              'vegetarian_friendly', 
                              'vegan_options','gluten_free', 'original_open_hours', 'open_days_per_week',
                              'open_hours_per_week', 'working_shifts_per_week',
                              'reviews_count_in_default_language', 'excellent', 'very_good',
                             'average', 'poor', 'terrible', 'food', 'service', 'value', 'atmosphere',
                             'keywords', 'default_language'], axis=1)

In [174]:
#filter the dataset to only include The british Island countries
britain_df = euro_resto_clean.loc[(euro_resto_clean['country'] == "England")| 
                                    (euro_resto_clean['country'] == "Ireland")|
                                   (euro_resto_clean['country'] == "Scotland")|
                                    (euro_resto_clean['country'] == "Wales")]

In [176]:
#remove any rows that have blank latitude, longitude or price_level
britain_df = britain_df.dropna(subset=['latitude', 'longitude', 'price_level'])

In [215]:

null_lat = britain_df['latitude'].isnull().sum()
null_lat

null_long = britain_df['longitude'].isnull().sum()

print(null_lat)
print(null_long)

0
0

In [216]:
# def truncate(n,decimals=4):
#     multiplier = 10**3
#     return (n*(10**3))/(10**3)

#truncate latitude
lat_list = britain_df['latitude'].tolist()

lat_list_trunc = []

for x in lat_list:
    n=4
    multiplier = 10**n
    value = int(x*(10**n))
    lat_list_trunc.append(value)
    

# lat_list_trunc

In [217]:
britain_df['lat_trunc'] = lat_list_trunc
britain_df.head(1)

,restaurant_link,restaurant_name,country,region,province,city,address,latitude,longitude,price_level,price_range,cuisines,avg_rating,total_reviews_count,default_language,lat_trunc,long_trunc,location_key,lat_trun
478379,g10021931-d3222824,Cafe Mylor,England,Cornwall,Falmouth,Mylor Churchtown,"Penarrow Road Mylor Yacht Harbour, Mylor Churc...",50.177025,-5.053397,€€-€€€,€5-€17,"Cafe, British",4.5,347.0,English,501770,-5053,50177_-5053,5017702

In [218]:
#truncate longitude
long_list = britain_df['longitude'].tolist()

long_list_trunc = []

for x in long_list:
    n=4
    multiplier = 10**n
    value = int(x*(10**n))
    long_list_trunc.append(value)

In [219]:
britain_df['long_trunc'] = long_list_trunc
britain_df.head(1)

,restaurant_link,restaurant_name,country,region,province,city,address,latitude,longitude,price_level,price_range,cuisines,avg_rating,total_reviews_count,default_language,lat_trunc,long_trunc,location_key,lat_trun
478379,g10021931-d3222824,Cafe Mylor,England,Cornwall,Falmouth,Mylor Churchtown,"Penarrow Road Mylor Yacht Harbour, Mylor Churc...",50.177025,-5.053397,€€-€€€,€5-€17,"Cafe, British",4.5,347.0,English,501770,-50533,50177_-5053,5017702

In [220]:
britain_df['lat_trunc'] = britain_df['lat_trunc'].astype(str)
britain_df['long_trunc'] = britain_df['long_trunc'].astype(str)

In [221]:
britain_df.dtypes

restaurant_link         object
restaurant_name         object
country                 object
region                  object
province                object
city                    object
address                 object
latitude               float64
longitude              float64
price_level             object
price_range             object
cuisines                object
avg_rating             float64
total_reviews_count    float64
default_language        object
lat_trunc               object
long_trunc              object
location_key            object
lat_trun                object
dtype: object

In [222]:
britain_df['location_key'] = britain_df[['lat_trunc', 'long_trunc']].agg('_'.join, axis=1)

In [223]:
britain_df.head()

,restaurant_link,restaurant_name,country,region,province,city,address,latitude,longitude,price_level,price_range,cuisines,avg_rating,total_reviews_count,default_language,lat_trunc,long_trunc,location_key,lat_trun
478379,g10021931-d3222824,Cafe Mylor,England,Cornwall,Falmouth,Mylor Churchtown,"Penarrow Road Mylor Yacht Harbour, Mylor Churc...",50.177025,-5.053397,€€-€€€,€5-€17,"Cafe, British",4.5,347.0,English,501770,-50533,501770_-50533,5017702
478380,g10029240-d10081265,Subway,England,Surrey,NaN,Byfleet,"39 Old Woking Road, Byfleet KT14 6LG England",51.337010,-0.504781,€,NaN,Deli,3.5,4.0,English,513370,-5047,513370_-5047,5133701
478382,g10029240-d11841828,Basmati tandoori,England,Surrey,NaN,Byfleet,"23 High Road, Byfleet KT14 7QH England",51.339140,-0.478110,€€-€€€,€6-€11,"Indian, Asian, Bangladeshi",3.0,4.0,English,513391,-4781,513391_-4781,5133914
478383,g10029240-d13010016,China Chef,England,Surrey,NaN,Byfleet,"72 High Road Byfleet, Byfleet KT14 7QL England",51.338920,-0.476430,€€-€€€,NaN,Chinese,2.5,10.0,English,513389,-4764,513389_-4764,5133892
478384,g10029240-d1827365,The Plough,England,Surrey,NaN,Byfleet,"104 High Road, Byfleet KT14 7QT England",51.338780,-0.474000,€€-€€€,NaN,"Pub, Bar, British",3.5,32.0,English,513387,-4740,513387_-4740,5133878

In [224]:
total_list = len(britain_df['location_key'].tolist())
unique_list = len(britain_df['location_key'].unique().tolist())
dupes = britain_df['location_key'].duplicated().count()
print(total_list)
print(unique_list)
print(total_list-unique_list)
print(dupes)

137465
132605
4860
137465

In [238]:
britain_df = britain_df.drop(['lat_trun','lat_trunc','long_trunc', 'price_range', 'default_language', 'restaurant_link'], axis=1).head(4)

### Correct the price_level

In [241]:
#check how many characters need to be corrected
unique_price_level = britain_df['price_level'].unique()
unique_price_level

array(['€€-€€€', '€'], dtype=object)

In [244]:
#apply the map function to turn euro symbol to number
britain_df['price_level'] = britain_df['price_level'].map({'€':1,'€€-€€€':2 })

In [248]:
britain_df

,restaurant_name,country,region,province,city,address,latitude,longitude,price_level,cuisines,avg_rating,total_reviews_count,location_key
478379,Cafe Mylor,England,Cornwall,Falmouth,Mylor Churchtown,"Penarrow Road Mylor Yacht Harbour, Mylor Churc...",50.177025,-5.053397,2,"Cafe, British",4.5,347.0,501770_-50533
478380,Subway,England,Surrey,NaN,Byfleet,"39 Old Woking Road, Byfleet KT14 6LG England",51.337010,-0.504781,1,Deli,3.5,4.0,513370_-5047
478382,Basmati tandoori,England,Surrey,NaN,Byfleet,"23 High Road, Byfleet KT14 7QH England",51.339140,-0.478110,2,"Indian, Asian, Bangladeshi",3.0,4.0,513391_-4781
478383,China Chef,England,Surrey,NaN,Byfleet,"72 High Road Byfleet, Byfleet KT14 7QL England",51.338920,-0.476430,2,Chinese,2.5,10.0,513389_-4764